#+STARTUP: content
#+DESCRIPTION: The main puprose of this config is create very simple, minimalistic and usefull setup.
#+DESCRIPTION: Also i plan to steal some usefull features from Doom emacs, but without copying it, cause it's very bloat in some cases.

#+TITLE: Emacs config
** Org
Add additional space before link insert
#+BEGIN_SRC emacs-lisp
(defun my-add-additional-space-when-not-exist (_)
  "Add additional sapce if previous char is not space!"
  (unless (eq (char-before) ? )
    (insert " ")))

(advice-add 'org-insert-link :before 'my-add-additional-space-when-not-exist)
#+END_SRC

Format org mode block
#+BEGIN_SRC emacs-lisp
(defun format-org-mode-block ()
  "Format org mode code block"
  (interactive "p")
  (org-edit-special)
  (format-all-ensure-formatter)
  (format-all-buffer)
  (org-edit-src-exit))
#+END_SRC

Init org mode faces for headlines
#+BEGIN_SRC emacs-lisp
(defun @setup-org-mode-faces ()
  "Setup faces for org mode"
  (custom-set-faces
   '(org-document-title ((t (:inherit outline-1 :height 2.5)))))
   ;; '(org-level-1 ((t (:inherit outline-5 :height 2.0))))
   ;; '(org-level-2 ((t (:inherit outline-5 :height 2.0))))
   ;; '(org-level-3 ((t (:inherit outline-5 :height 2.0))))
   ;; '(org-level-4 ((t (:inherit outline-5 :height 2.0))))
   ;; '(org-level-5 ((t (:inherit outline-5 :height 2.0)))))
)
#+END_SRC

#+RESULTS:
: @setup-org-mode-faces

** Universal keybindings across keyboard layouts
#+BEGIN_SRC emacs-lisp :results silent
(use-package char-fold
  :ensure nil
  :custom
  (char-fold-symmetric t)
  (search-default-mode #'char-fold-to-regexp))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package reverse-im
  :demand t ; always load it
  :after char-fold ; but only after `char-fold' is loaded
  :custom
  (reverse-im-char-fold t) ; use lax matching
  (reverse-im-read-char-advice-function #'reverse-im-read-char-include)
  (reverse-im-input-methods '("russian-computer")) ; translate these methods
  :config
  (reverse-im-mode t))
#+END_SRC

#+RESULTS:
: [nil 26177 52845 327680 nil elpaca-process-queues nil nil 999999 nil]

** Evil
Patch for recover visual line after shifting
#+NAME: evil-shifting-config
#+BEGIN_SRC emacs-lisp  :tangle no
(define-key evil-visual-state-map (kbd ">") '@evil-shift-right-visual)
(define-key evil-visual-state-map (kbd "<") '@evil-shift-left-visual)
(define-key evil-visual-state-map [tab] '@evil-shift-right-visual)
(define-key evil-visual-state-map [S-tab] '@evil-shift-left-visual)

(defun @evil-shift-left-visual ()
  (interactive)
  (evil-shift-left (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore))

(defun @evil-shift-right-visual ()
  (interactive)
  (evil-shift-right (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore))
#+END_SRC

Evil should respect visual line mode
#+NAME: evil-respect-visual-line-mode
#+BEGIN_SRC emacs-lisp  :tangle no
(defun evil-next-line--check-visual-line-mode (orig-fun &rest args)
  (if visual-line-mode
      (apply 'evil-next-visual-line args)
    (apply orig-fun args)))

(advice-add 'evil-next-line :around 'evil-next-line--check-visual-line-mode)

(defun evil-previous-line--check-visual-line-mode (orig-fun &rest args)
  (if visual-line-mode
      (apply 'evil-previous-visual-line args)
    (apply orig-fun args)))

(advice-add 'evil-previous-line :around 'evil-previous-line--check-visual-line-mode)
#+END_SRC


#+BEGIN_SRC emacs-lisp  :noweb yes
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package evil
  :init
  (setq evil-want-keybinding nil)
  :config

  (modify-syntax-entry ?_ "w")
  (setq evil-v$-excludes-newline t)
  <<evil-shifting-config>>
  <<evil-respect-visual-line-mode>>
  (setq evil-respect-visual-line-mode t)
  (evil-set-undo-system 'undo-fu)
  (setq-default evil-kill-on-visual-paste nil)
  (evil-mode 1)
  <<general-minibuffer-mode-map>>)
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (org-eval-in-calendar '(calendar-backward-day 1)) |

** Bookmarks
Bookmark for navigation inside file
#+BEGIN_SRC emacs-lisp
(use-package bm
:defer t
:custom-face
(bm-face ((t (:foreground ,+m-color-secondary :background unspecified))))
:custom
(bm-in-lifo-order t)
:bind (("M-s-n" . bm-next)
        ("M-s-p" . bm-previous)
        ("s-b" . bm-toggle)))
#+END_SRC

#+RESULTS:
: [nil 26217 44217 235873 nil elpaca-process-queues nil nil 999999 nil]

*** File info
#+BEGIN_SRC emacs-lisp 
(use-package file-info
  :bind
  (("C-c d" . 'file-info-show)
   ("s-'" . 'file-info-show))
  :defer t
  :config
  (setq hydra-hint-display-type 'posframe)
  (setq hydra-posframe-show-params '(:poshandler posframe-poshandler-frame-center
                                                 :internal-border-width 2
                                                 :internal-border-color "#61AFEF"
                                                 :left-fringe 16
                                                 :right-fringe 16)))
#+END_SRC

#+RESULTS:
: [nil 26193 61646 215592 nil elpaca-process-queues nil nil 999999 nil]

** Folding (origami)
#+BEGIN_SRC emacs-lisp 
(use-package origami
  :hook ((org-mode
          dart-mode
          yaml-mode
          js-ts-mode
          yaml-ts-mode
          python-mode
          python-ts-mode
          html-mode
          ng2-html-mode
          emacs-lisp-mode
          typescript-ts-mode
          go-ts-mode
          python-ts-mode) . origami-mode)
  :after evil)
#+END_SRC

#+RESULTS:
: [nil 26202 13717 589909 nil elpaca-process-queues nil nil 999999 nil]

*** Treesit fold. Core package
#+BEGIN_SRC emacs-lisp :noweb yes
(use-package treesit-fold
  :ensure (treesit-fold :type git :host github :repo "abougouffa/treesit-fold")
  :hook ((tree-sitter-mode
          web-mode
          ng2-html-mode
          ng2-ts-mode
          typescript-mode
          js-mode
          python-mode
          html-mode
          json-mode
          go-mode
          bash-mode
          css-mode
          scss-mode
          go-ts-mode
          typescript-ts-mode) . @treesit-fold-init)
  :general
  <<ts-fold-general-keybindings>>
  :config
  (add-to-list 'ts-fold-range-alist '(ng2-ts-mode . ((export_clause . ts-fold-range-seq)
                                                     (statement_block . ts-fold-range-seq)
                                                     (comment . ts-fold-range-c-like-comment))) t)

  (add-to-list 'ts-fold-range-alist '(web-mode . (html-mode
                                                  (element . ts-fold-range-html)
                                                  (comment ts-fold-range-seq 1 -1))))

  (add-to-list 'ts-fold-range-alist '(ng2-html-mode . (html-mode
                                                       (element . ts-fold-range-html)
                                                       (comment ts-fold-range-seq 1 -1))))
  (add-to-list 'ts-fold-range-alist '(scss-mode . ((keyframe_block_list . ts-fold-range-seq)
                                                   (block . ts-fold-range-seq)
                                                   (comment . ts-fold-range-c-like-comment))) t)


  (add-to-list 'ts-fold-range-alist '(typescript-ts-mode . ((export_clause . ts-fold-range-seq)
                                                            (statement_block . ts-fold-range-seq)
                                                            (comment . ts-fold-range-c-like-comment))))

  (add-to-list 'ts-fold-range-alist `(typescript-ts-mode . ,(ts-fold-parsers-typescript)))
  (add-to-list 'ts-fold-range-alist `(go-ts-mode . ,(ts-fold-parsers-go)))
  ;; (add-to-list 'ts-fold-range-alist '(go-ts-mode . ts-fold-summary-go))

  ;; TODO: DOESN'T WORK for scss, needs another rules (check it later for custom pareser)
  (add-to-list 'ts-fold-range-alist '(scss-mode . (css-mode
                                                   (keyframe_block_list . ts-fold-range-seq)
                                                   (block . ts-fold-range-seq)
                                                   (comment . ts-fold-range-c-like-comment)))))


  ;; TODO: check changes for correct mode cast
  ;; (add-to-list 'ts-fold-foldable-node-alist '(ng2-ts-mode comment statement_block export_clause))
  ;; (add-to-list 'ts-fold-foldable-node-alist '(web-mode comment element))
  ;; (add-to-list 'ts-fold-foldable-node-alist '(scss-mode comment block keyframe_block_list))
  ;; (add-to-list 'ts-fold-foldable-node-alist '(ng2-html-mode comment element)))
#+END_SRC

#+RESULTS:
: [nil 26197 60087 99576 nil elpaca-process-queues nil nil 999999 nil]

*** Switch to scratch buffer
#+BEGIN_SRC emacs-lisp 
(defun @switch-to-scratch ()
  "Switch to scratch buffer"
  (interactive)
  ;; (persistent-scratch-autosave-mode -1)
  (let* ((buffer-name "*quicknote*")
         (buffer (get-buffer buffer-name)))

    (unless buffer
      (persistent-scratch-setup-default)
      (setq buffer (get-buffer-create buffer-name))
      (persistent-scratch-restore))
    
    (message "current buffer: %s" buffer)
    (with-current-buffer buffer
      (pop-to-buffer buffer)
      ;; (when (equal (s-trim (buffer-substring-no-properties (point-min) (point-max))) "")
      ;;   (message "Persistent scratch restored")
      ;;   (persistent-scratch-setup-default))
      ;; (goto-char (point-max))
      ;; (unless (eq major-mode 'org-mode)
      ;;   (org-mode))
      (org-mode)
      (evil-insert-state))))
#+END_SRC

#+RESULTS:
: @switch-to-scratch

*** Persistent scratch
Override function for autosaving
#+BEGIN_SRC emacs-lisp
(defvar @persistent-scratch-last-content nil)

(defun @persistent-scratech-savable-p ()
  "Return non-nil if the current buffer is savable."
  (when-let* ((current-buffer-scratch-p (string= (buffer-name) "*quicknote*"))
              (scratch-buffer (get-buffer "*quicknote*"))
              (scratch-buffer-content (with-current-buffer scratch-buffer
                                        (buffer-string)))
              (scratch-buffer-content-not-empty (not (equal scratch-buffer-content ""))))
    ;; (scratch-buffer-content-changed (not (equal scratch-buffer-content @persistent-scratch-last-content)))
    ;; (scratch-string-not-nil (not (equal scratch-buffer-content "nil"))))

    ;; (setq @persistent-scratch-last-content scratch-buffer-content)
    ;; (message "buffer name %s, buffer content %s, content true? %s"
    ;;          (get-buffer "*quicknote*")
    ;;          (with-current-buffer "*quicknote*"
    ;;            (buffer-string))
    ;;          (with-current-buffer "*quicknote*"
    ;;            (not (equal (buffer-string) ""))))
    t))

(defun @save-scratch-buffer-p ()
  "Return non-nil if the current buffer is the scratch buffer."

  (let ((persistent-scrach-savable-p (@persistent-scratech-savable-p)))
    persistent-scrach-savable-p))

(setq persistent-scratch-scratch-buffer-p-function #'@save-scratch-buffer-p)
#+END_SRC

#+RESULTS:
: @save-scratch-buffer-p

#+BEGIN_SRC emacs-lisp
(defun @preserve-persistent-scratch ()
  "Preserve the persistent scratch buffer. Make backup."
  (interactive)
  (persistent-scratch-save)
  (persistent-scratch-new-backup))
#+END_SRC

#+RESULTS:
: @save-scratch-buffer-p

#+NAME: persistent-scratch-save
#+BEGIN_SRC emacs-lisp :tangle no
(defun persistent-scratch-save (&optional file)
  "Save the current state of scratch buffers.
When FILE is non-nil, the state is saved to FILE; when nil or when called
interactively, the state is saved to `persistent-scratch-save-file'.
What state exactly is saved is determined by `persistent-scratch-what-to-save'.

When FILE is nil and `persistent-scratch-backup-directory' is non-nil, a copy of
`persistent-scratch-save-file' is stored in that directory, with a name
representing the time of the last `persistent-scratch-new-backup' call."
  (interactive)
  (let* ((actual-file (or file persistent-scratch-save-file))
         (tmp-file (concat actual-file ".new"))
         (saved-state (persistent-scratch--save-buffers-state)))
    (when (car saved-state)
      (let ((old-umask (default-file-modes)))
        (set-default-file-modes #o600)
        (unwind-protect
            (let ((coding-system-for-write 'utf-8-unix))
              (write-region (cdr saved-state) nil tmp-file nil 0))
          (set-default-file-modes old-umask)))
      (run-hook-with-args 'persistent-scratch-before-save-commit-functions tmp-file)
      (rename-file tmp-file actual-file t)
      (dolist (buffer (car saved-state))
        (with-current-buffer buffer
          (set-buffer-modified-p nil)))
      (when (called-interactively-p 'interactive)
        (message "Wrote persistent-scratch file %s" actual-file)))
    (unless file
      (persistent-scratch--update-backup)
      (persistent-scratch--cleanup-backups))))
#+END_SRC

Override autosave function. What is the sense save buffer whic doesn't exist??? 

#+BEGIN_SRC emacs-lisp :noweb yes
(use-package persistent-scratch
 :demand t
 :general
 (:states '(normal visual)
          :keymaps 'override
          "SPC x" '@switch-to-scratch)
  :config
  <<persistent-scratch-save>>
  (setq persistent-scratch-backup-directory "~/apps/pure-emacs/backups")
  (persistent-scratch-autosave-mode)
  (setq persistent-scratch-autosave-interval 5)
)
#+END_SRC

#+RESULTS:

Override autosave function. What is the sense save buffer whic doesn't exist??? 


*** Treesit core
# Right not its not supporteed well. Moreover, tree-sitter-hl-mode is really better then built in functionality
#+BEGIN_SRC emacs-lisp 
(use-package treesit                    ;
  :ensure nil
  ;; :commands (treesit-install-language-grammar nf/treesit-install-all-languages)
  ;; :hook ((typescript-ts-base-mode
  ;;         go-ts-mode
  ;;         python-ts-mode
  ;;         css-ts-mode) . init-tree-sitter-hl-mode)
  :hook
  (go-ts-mode . (lambda () (setq-local tab-width 2)))
  :custom
  (go-ts-mode-indent-offset 2)
  :config
  (add-hook 'typescript-ts-mode-hook #'@setup-typescript-highlights)
  (setq treesit-font-lock-level 4))
#+END_SRC

#+RESULTS:
: [nil 26192 58130 222559 nil elpaca-process-queues nil nil 999999 nil]

*** Setup compilation errors
#+BEGIN_SRC emacs-lisp
(defun @setup-compilation-errors ()
  (interactive)
  (setq compilation-scroll-output t)
  (setq compilation-error-regexp-alist '())
  (setq compilation-error-regexp-alist-alist '())


  ;; eslint https://github.com/Fuco1/compile-eslint/blob/master/compile-eslint.el
  (when (not compilation-error-regexp-alist-alist)
    (setq compilation-error-regexp-alist-alist '()))

  (let ((form `(eslint
                ,(rx-to-string
                  '(and (group (group (+ digit)) ":" (group (+ digit)))
                        (+ " ") (or "error" "warning")))
                compile-eslint--find-filename
                2 3 2 1)))

    (if (assq 'eslint compilation-error-regexp-alist-alist)
        (setf (cdr (assq 'eslint compilation-error-regexp-alist-alist)) (cdr form))
      (push form compilation-error-regexp-alist-alist)))
  (push 'eslint compilation-error-regexp-alist)



  (add-to-list 'compilation-error-regexp-alist '("^[[:blank:]]*\\([/_-\\.[:alnum:]]+\\):\\([[:digit:]]+\\):\\([[:digit:]]+\\) - error.*$" 1 2 3))
  ;; React
  (add-to-list 'compilation-error-regexp-alist '("[[:blank:]]*\\([/_\\.[:alnum:]-]+\\):\\([[:digit:]]+\\):\\([[:digit:]]+\\) - error.*$" 1 2 3))
  ;; Angular
  (add-to-list 'compilation-error-regexp-alist '("^Error: \\([_[:alnum:]-/.]*\\):\\([0-9]+\\):\\([0-9]+\\)" 1 2 3))
  ;; Angular vite
  (add-to-list 'compilation-error-regexp-alist '("\\([_[:alnum:]-/.]*\\):\\([0-9]+\\):\\([0-9]+\\)" 1 2 3))

  ;; New eslint
  (add-to-list 'compilation-error-regexp-alist '("^\\([_[:alnum:]-/.]*\\)\n[[:blank:]]*\\([0-9]+\\):\\([0-9]+\\)" 1 2 3))

  ;; Flutter
  ;; (add-to-list 'compilation-error-regexp-alist '("[[:blank:]]*\\([/_\\.[:alnum:]-]+\\):\\([[:digit:]]+\\):\\([[:digit:]]+\\): Error.*$"))
  (add-to-list 'compilation-error-regexp-alist 'dart-analyze)
  (add-to-list 'compilation-error-regexp-alist-alist '(dart-analyze "\\([^ ]*\\.dart\\):\\([0-9]+\\):\\([0-9]+\\)" 1 2 3)))
#+END_SRC

#+RESULTS:
: @setup-compilation-errors

** Copilot
TODO: check copilot + blamer
#+BEGIN_SRC emacs-lisp
(use-package copilot
  :defer 5
  :ensure (:host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
  :hook
  (prog-mode . copilot-mode)
  (text-mode . copilot-mode)
  :general
  (:keymaps 'override
            "s-]" 'copilot-next-completion
            "s-[" 'copilot-previous-completion
            "s-l" 'copilot-accept-completion
            "s-j" 'copilot-complete
            "s-;" 'copilot-accept-completion-by-word
            "s-/" 'copilot-accept-completion-by-line)
  :custom
  (copilot-idle-delay 0.3)
  :config
  (setq copilot--previous-point nil)
  (setq copilot--previous-window-width nil)

  (copilot-diagnose)
  ;; (global-copilot-mode)
  (add-hook 'evil-insert-state-entry-hook (lambda ()
                                            (setq blamer--block-render-p t)
                                            (when (fboundp 'blamer--clear-overlay)

                                              (blamer--clear-overlay))))
  (add-hook 'evil-normal-state-entry-hook (lambda ()
                                            (setq blamer--block-render-p nil)
                                            (copilot-clear-overlay))))

#+END_SRC

#+RESULTS:
: [nil 26193 48854 290335 nil elpaca-process-queues nil nil 999999 nil]


** Turbo log. Quick log inserting
#+BEGIN_SRC emacs-lisp 
(use-package turbo-log
  :defer t
  :ensure (turbo-log :type git :host github :repo "Artawower/turbo-log.el" :branch "feat/treesit-migration")
  :commands (turbo-log--get-context)
  :bind (("C-s-l" . turbo-log-print)
         ("C-s-i" . turbo-log-print-immediately)
         ("C-s-h" . turbo-log-comment-all-logs)
         ("C-s-s" . turbo-log-uncomment-all-logs)
         ("C-s-x" . turbo-log-delete-all-logs)
         ("C-s-[" . turbo-log-paste-as-logger )
         ("C-s-]" . turbo-log-paste-as-logger-immediately))
  :custom
  (turbo-log-allow-insert-without-tree-sitter-p t)
  ;; (turbo-log-payload-format-template "")
  ;; (turbo-log-payload-format-template "\x1b[35m%s: ")
  (turbo-log-payload-format-template "%s: ")
  :config
  (turbo-log-configure
   :modes (typescript-ts-mode tsx-ts-mode typescript-mode js2-mode web-mode ng2-ts-mode js-mode)
   :strategy merge
   :post-insert-hooks ((lambda () (interactive) (call-interactively 'apheleia-format-buffer)) lsp)
   ;; :msg-format-template "'🦄: %s'"
   :msg-format-template "'✎: %s'"))
#+END_SRC

#+RESULTS:
: [nil 26198 4723 375035 nil elpaca-process-queues nil nil 999999 nil]

** Angular
#+BEGIN_SRC emacs-lisp :tangle no
(use-package ng2-mode
  :after typescript-mode
  :hook
  (ng2-html-mode . web-mode)
  :config
  (setq lsp-clients-angular-language-server-command
        '("node"
          "/opt/homebrew/lib/node_modules/@angular/language-server"
          "--ngProbeLocations"
          "/opt/homebrew/lib/node_modules"
          "--tsProbeLocations"
          "/opt/homebrew/lib/node_modules"
          "--stdio")))
#+END_SRC

#+RESULTS:
| ng2-mode | init-tree-sitter-hl-mode | auto-rename-tag-mode | lsp-deferred | prettier-mode | @treesit-fold-init |

** Tramp
#+BEGIN_SRC emacs-lisp
(use-package tramp
  :ensure nil
  :config
  (setenv "SHELL" "/bin/bash")
  (setq remote-file-name-inhibit-cache nil)
  (setq vc-ignore-dir-regexp
        (format "%s\\|%s"
                vc-ignore-dir-regexp
                tramp-file-name-regexp))
  (setq tramp-verbose 1)
  (add-to-list 'tramp-connection-properties
               (list (regexp-quote "/sshx:user@host:")
                     "remote-shell" "/usr/bin/bash"))
  (add-to-list 'tramp-connection-properties
               (list ".*" "locale" "LC_ALL=C")))
#+END_SRC

#+RESULTS:
| .*      | locale               | LC_ALL=C |
| /sshfs: | direct-async-process | t        |

